app/views/home/index.html.erb

      <% if current_user.admin? %>
        How many admins <%= User.count %>
---
SELECT COUNT(*) FROM "users"