app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello world"], ["created_at", "2022-08-18 04:53:33.598203"], ["updated_at", "2022-08-18 04:53:33.598203"], ["user_id", nil]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save