app/views/layouts/_each.html.erb

<% Post.all.each do |post| %>
---
SELECT "posts".* FROM "posts"