app/views/layouts/_post_latest.html.erb

<% Post.all.each do |post| %>
---
SELECT "posts".* FROM "posts"